// ระยะห่างสูงสุด (หน่วย: กิโลเมตร) ที่จะถือว่าตรงกับสถานที่นั้นๆ (เช่น 0.8 km = 800 เมตร)
const MATCH_THRESHOLD_KM = 1.2;

// รายชื่อสถานที่วิ่งประจำ และ พิกัด [Latitude, Longitude]
const SAVED_LOCATIONS = {
  //เชียงใหม่
  "มอเชียงใหม่":[18.806685, 98.953690],
  "สนามกลาง มอเชียงใหม่":[18.797302,98.957027],
  "สนาม700ปีเชียงใหม่":[18.839215, 98.963045],
  "สวน อบจ.เชียงใหม่":[18.833825, 98.966798],
  "Maya Square":[18.801484, 98.967391],
  
  //เขาย้อย เพรชบุรี
  "สวนหน้าถ้ำเขาย้อย":[13.234100, 99.829912],

  // กรุงเทพ
  "มหิดล ศาลยา":[13.793635,100.317493],
  "พุทธมณฑล":[13.777628, 100.321785],
  "อัสสัมชัญ ธนบุรี":[13.733997, 100.370375],
  "สวนสมเด็จย่า(สายสอง)":[13.782956, 100.392061],
  "สวนสายสอง": [13.753311, 100.395465],
  "รพ.ศิริราช":[13.758710, 100.484922],
  "สนามหลวง":[13.753229, 100.493566],

  //บางแสน
  "บางแสนเฮอร์ริเทจ": [13.291722, 100.909130],
  "วงเวียนบางแสน": [13.283754, 100.915553],

  //บางพระ
  "สวนบางพระ":[13.207152, 100.935428],
  "เขาเขียว":[13.205165, 101.041115],
  "เขาฉลาก": [13.19928, 100.95586],
  "ศูนย์พัฒประมงชลบุรี":[13.23043,100.97672],
  "ครัวในสวน อ่างบางพระ":[13.235189,100.987694],
  "สวนหนองค้อ":[13.126595, 101.047822],

  // ศรีราชา
  "เซนสิริทาวน์ แหลมฉบัง(อ่าวอุดม)":[13.120544, 100.932655],
  "เซนสิริสปอร์ตทาวน์":[13.117110, 100.931267],
  "สวนสุขภาพเกาะลอย": [13.171544, 100.925048],
  "สนามเทศบาลศรีราชา":[13.172207, 100.928422],
  "มอเกษตรศรีราชา":[13.122655, 100.918792],
  "สนามเทศบาลแหลมฉบัง":[13.116990, 100.918557],
  "สวนแหลมฉบัง":[13.084887, 100.922320],


  // งานวิ่งอื่น ๆ
  "Terminal Pattaya":[12.950789,100.888952],
  "Central Pattaya Beach":[12.938356, 100.883560],
  "หาดดงตาล":[12.899143, 100.866440],
  "สวนสัตว์เปิดเขาเขียว":[13.21441833,101.05597667],
  "วิหารเซียน เขาชีจรรย์":[12.788332, 100.953700],
  "กองบัญชาการ หน่วยบัญชาการ นาวิกโยธิน":[12.665391, 100.862348],
  "หาดแหลมเจริญ":[12.656792, 101.275069],

};